Revit 2027 API
RebarConstraintsManager.GetAllConstrainedHandles Method
 Retrieves all handles on the Rebar that are constrained to external references.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<RebarConstrainedHandle> GetAllConstrainedHandles()
Public Function GetAllConstrainedHandles As IList(Of RebarConstrainedHandle)
public:
IList<RebarConstrainedHandle^>^ GetAllConstrainedHandles()
member GetAllConstrainedHandles : unit -> IList<RebarConstrainedHandle>
Return Value
IList<RebarConstrainedHandle>
 A collection of RebarConstrainedHandles
Exceptions
Exception | Condition
InvalidOperationException |  The RebarConstraintsManager does not manage a valid Rebar element.
See Also
Reference
RebarConstraintsManager Class
Autodesk.Revit.DB.Structure Namespace